## 建立Series

In [94]:
import pandas as pd
se = pd.Series([1,2,3,4,5])
print(se)           #顯示Series
print(se.values)    #顯示值
print(se.index)     #顯示索引
se.iloc[0] = 6      #將se第一個值 切換到6
print(se)

0    1
1    2
2    3
3    4
4    5
dtype: int64
[1 2 3 4 5]
RangeIndex(start=0, stop=5, step=1)
0    6
1    2
2    3
3    4
4    5
dtype: int64

In [95]:
dict1 = {'Taipei': '台北', 'Taichung': '台中', 'Kaohsiung': '高雄'}
se = pd.Series(dict1)
print(se)           #顯示Series
print(se.values)    #顯示值
print(se.index)     #顯示索引
print(se['Taipei']) #用索引取值

Taipei       台北
Taichung     台中
Kaohsiung    高雄
dtype: object
['台北' '台中' '高雄']
Index(['Taipei', 'Taichung', 'Kaohsiung'], dtype='object')
台北

In [96]:
print(se['Taichung':'Kaohsiung']) # 取範圍

Taichung     台中
Kaohsiung    高雄
dtype: object

## Series資料取值

In [97]:
import pandas as pd
se = pd.Series([1,2,3,4,5])
se[2] # 找出se的第三筆資料

3

In [98]:
import pandas as pd
se = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
se['b'] #用index找出b對應的值 2:b

2

## 利用字典建立DataFrame

In [99]:
import pandas as pd
df = pd.DataFrame([[65,92,78,83,70], 
                   [90,72,76,93,56], 
                   [81,85,91,89,77], 
                   [79,53,47,94,80]],
                   index=['王小明','李小美','陳大同','林小玉'],
                   columns=['國文','英文','數學','自然','社會'])
df

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  77
林小玉  79  53  47  94  80

In [100]:
import pandas as pd
scores = {'國文':{'王小明':65,'李小美':90,'陳大同':81,'林小玉':79},
          '英文':{'王小明':92,'李小美':72,'陳大同':85,'林小玉':53},
          '數學':{'王小明':78,'李小美':76,'陳大同':91,'林小玉':47},
          '自然':{'王小明':83,'李小美':93,'陳大同':89,'林小玉':94},
          '社會':{'王小明':70,'李小美':56,'陳大同':94,'林小玉':80}}
df = pd.DataFrame(scores)
df

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [101]:
## 利用Series建立DataFrame

In [102]:
import pandas as pd
se1 = pd.Series({'王小明':65,'李小美':90,'陳大同':81,'林小玉':79})
se2 = pd.Series({'王小明':92,'李小美':72,'陳大同':85,'林小玉':53})
se3 = pd.Series({'王小明':78,'李小美':76,'陳大同':91,'林小玉':47})
se4 = pd.Series({'王小明':83,'李小美':93,'陳大同':89,'林小玉':94})
se5 = pd.Series({'王小明':70,'李小美':56,'陳大同':94,'林小玉':80})
df = pd.DataFrame({ '國文':se1,'英文':se2,'數學':se3,
                   '自然':se4,'社會':se5} )
df

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [111]:
import pandas as pd
se1 = pd.Series({'王小明':65,'李小美':90,'陳大同':81,'林小玉':79})
se2 = pd.Series({'王小明':92,'李小美':72,'陳大同':85,'林小玉':53})
se3 = pd.Series({'王小明':78,'李小美':76,'陳大同':91,'林小玉':47})
se4 = pd.Series({'王小明':83,'李小美':93,'陳大同':89,'林小玉':94})
se5 = pd.Series({'王小明':70,'李小美':56,'陳大同':94,'林小玉':80})
df = pd.concat([se1,se2,se3,se4,se5], axis=1)
df.columns=['國文','英文','數學','自然','社會']
df

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

## DataFrame基本取值

In [104]:
df[['數學','自然','社會']]

     數學  自然  社會
王小明  78  83  70
李小美  76  93  56
陳大同  91  89  94
林小玉  47  94  80

In [105]:
# 假設 df 是包含學生成績的 DataFrame，並且具有 '國文' 和 '自然' 兩列
filtered_df = df[(df['國文'] >= 80) & (df['自然'] >= 90)]
filtered_df

     國文  英文  數學  自然  社會
李小美  90  72  76  93  56

In [106]:
df.values # DataFrame的valus

array([[65, 92, 78, 83, 70],
       [90, 72, 76, 93, 56],
       [81, 85, 91, 89, 94],
       [79, 53, 47, 94, 80]], dtype=int64)

In [107]:
df.values[1] # DataFrame的valus[1]

array([90, 72, 76, 93, 56], dtype=int64)

In [108]:
df.values[1][2]

76

In [109]:
df = df[df.index == '王小明']  # 用索引取出王小明
df

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70

## 以索引及欄位名稱取得資料：df.loc()

In [112]:
df.loc["林小玉","社會"]

80

In [114]:
df.loc["王小明", ["國文","社會"]]

國文    65
社會    70
Name: 王小明, dtype: int64

In [115]:
df.loc[["王小明", "李小美"], ["數學", "自然"]]

     數學  自然
王小明  78  83
李小美  76  93

In [118]:
df.loc["王小明":"陳大同", "數學":"社會"]

     數學  自然  社會
王小明  78  83  70
李小美  76  93  56
陳大同  91  89  94

In [119]:
df.loc["陳大同", :]

國文    81
英文    85
數學    91
自然    89
社會    94
Name: 陳大同, dtype: int64

## 以索引及欄位編號取得資料：df.iloc()

In [123]:
df

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [125]:
df.iloc[3,4] # 取得林小玉的社會分數

80

In [126]:
df.iloc[0,[0,4]]

國文    65
社會    70
Name: 王小明, dtype: int64

In [143]:
df.iloc[[0,3],[1,3]]  #王小明跟林小玉的英文跟社會分數
df

     國文  英文  數學  自然  社會
王小明  65  85  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [144]:
df.iloc[0:3,2:5]

     數學  自然  社會
王小明  78  83  70
李小美  76  93  56
陳大同  91  89  94

In [145]:
df.iloc[2, :]  # 陳大同欄位的所有分數

國文    81
英文    85
數學    91
自然    89
社會    94
Name: 陳大同, dtype: int64

In [147]:
df.head(2) # 取得最前兩筆

     國文  英文  數學  自然  社會
王小明  65  85  78  83  70
李小美  90  72  76  93  56

In [146]:
df.tail(2) # 取得最後兩筆

     國文  英文  數學  自然  社會
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

## DataFrame資料排序

In [151]:
df.sort_values(by="數學", ascending=False)

     國文  英文  數學  自然  社會
陳大同  81  85  91  89  94
王小明  65  85  78  83  70
李小美  90  72  76  93  56
林小玉  79  53  47  94  80

In [152]:
df.sort_index(axis=0)  #以國文分數由高到低

     國文  英文  數學  自然  社會
李小美  90  72  76  93  56
林小玉  79  53  47  94  80
王小明  65  85  78  83  70
陳大同  81  85  91  89  94

## DataFrame資料修改

In [155]:
df.loc['王小明','英文'] = 85 # 王小明英文分數改85
# df = df.drop(columns=['王小明']) # 刪除王小明多餘的columns
df

     國文  英文  數學  自然  社會
王小明  65  85  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [163]:
df.loc["王小明",:] = 80 #王小明分數全部改80
df

     國文  英文  數學  自然  社會
王小明  80  80  80  80  80
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

## 刪除DataFrame資料

In [182]:
df.drop('王小明')

     國文  英文  數學  自然  社會
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [169]:
df.drop("數學", axis=1)

     國文  英文  自然  社會
王小明  80  80  80  80
李小美  90  72  93  56
陳大同  81  85  89  94
林小玉  79  53  94  80

In [170]:
df.drop(["數學", "自然"], axis=1)

     國文  英文  社會
王小明  80  80  80
李小美  90  72  56
陳大同  81  85  94
林小玉  79  53  80

In [173]:
df.drop(["數學","自然"],axis=1)

     國文  英文  社會
王小明  80  80  80
李小美  90  72  56
陳大同  81  85  94
林小玉  79  53  80

In [174]:
df.drop(df.index[1:4])

     國文  英文  數學  自然  社會
王小明  80  80  80  80  80

In [178]:
df.drop(df.columns[1:4], axis=1)

     國文  社會
王小明  80  80
李小美  90  56
陳大同  81  94
林小玉  79  80